fix event storming
